app/controllers/reservations_controller.rb

	def show
		return render_notify(401,:error,"not allowed") unless @current_user.reservation_ids.include?(params[:id].to_i)
		@reservation=Reservation.find(params[:id].to_i)
---
SELECT "reservations".id FROM "reservations" WHERE "reservations"."user_id" = 1
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", 1]]

	def create
		return render_notify(406,:error,"museum not available: #{params[:museum]}") unless getMuseumsList.include? params[:museum].gsub(' ','_')
		@reservation = @current_user.reservations.new(museum: params[:museum],date: params[:date],num_of_people: params[:num_of_pipl])
		if @reservation.save
---
INSERT INTO "reservations" ("created_at", "date", "museum", "num_of_people", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 25 Sep 2012 09:02:43 UTC +00:00], ["date", "25-5-56"], ["museum", "louvre"], ["num_of_people", 5], ["updated_at", Tue, 25 Sep 2012 09:02:43 UTC +00:00], ["user_id", 1]]

	def destroy
		return render_notify(401,:error,"not allowed") unless @current_user.reservation_ids.include?(params[:id].to_i)
		@reservation=Reservation.find(params[:id].to_i)
		@current_user.reservations.delete @reservation
---
SELECT "reservations".id FROM "reservations" WHERE "reservations"."user_id" = 1
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", 11]]
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 11]]